In [26]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [27]:
data=pd.read_excel("Book1.xlsx",sheet_name='Sheet1')
data.head()

   SALESPERSON  Old Scheme (in thousands)  New Scheme (in thousands)
0            1                         57                         62
1            2                        103                        122
2            3                         59                         54
3            4                         75                         82
4            5                         84                         84

In [28]:
#Question 1 #Find the mean of old scheme and new scheme column. (5 points)

#Answer 1

In [30]:
# mean of old schema in thousands 
ols=data["Old Scheme (in thousands)"].mean()
ols

68.03333333333333

In [31]:
#mean of new schema  in thousands 
nes=data["New Scheme (in thousands)"].mean()
nes

72.03333333333333

In [32]:
# Question2 #Use the five percent significance test over the data to determine the p value to check new scheme has significantly raised outputs?

#Answer 2



Observation from data are as folows

•Since population standard deviation is unkown so we have to use t stat test
•given signifance level i.e aplha is 0.05
•sample size = 30 








Hypothesis Formulation
•H0 (NULL hypothesis) : new scheme has not significantly raised outputs i.e there is no change in means M1 == M2 
•H1 (Alternate hypothesis) : new scheme has significantly raised outputs i.e there is change in means M1 < M2 or M2 -M1 > 0
•Since same set of sales person sample is used and population standard deviation is unknown so we use paired sample t-test

In [34]:
# mean difference 
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
SALESPERSON                  30 non-null int64
Old Scheme (in thousands)    30 non-null int64
New Scheme (in thousands)    30 non-null int64
dtypes: int64(3)
memory usage: 800.0 bytes

In [35]:
# value in thousands 
mdiff=nes-ols
mdiff

4.0

In [37]:
# checking standard deviation 
data.describe()

       SALESPERSON  Old Scheme (in thousands)  New Scheme (in thousands)
count    30.000000                  30.000000                  30.000000
mean     15.500000                  68.033333                  72.033333
std       8.803408                  20.455980                  24.062395
min       1.000000                  28.000000                  32.000000
25%       8.250000                  54.000000                  55.000000
50%      15.500000                  67.000000                  74.000000
75%      22.750000                  81.500000                  85.750000
max      30.000000                 110.000000                 122.000000

In [38]:
from scipy.stats import ttest_1samp, ttest_ind,mannwhitneyu,levene,shapiro,wilcoxon
from statsmodels.stats.power import ttest_power
from scipy import stats

In [42]:
ttest,pval=stats.ttest_rel(data["Old Scheme (in thousands)"],data["New Scheme (in thousands)"])
print("p-value" ,pval)
print("t test value ",ttest)

p-value 0.13057553961337662
t test value  -1.5559143823544377

In [ ]:
#Since p value is greator than 0.05 we accept  accept Null Hypothesis ,new scheme has no significantly raised outputs

In [43]:
#question 3 What conclusion does the test (p-value) lead to?

#Answer 3

Since p value is greator than 0.05 we accept  accept Null Hypothesis i.e. new scheme has no significantly raised outputs

#Question 4 
    Suppose it has been calculated that in order for Titan to break even, the average output must increase by £5000 in the scheme compared to the old scheme. If this figure is alternative hypothesis, what is:

        a) The probability of a type 1 error? (2.5 points)

        b) What is the p- value of the hypothesis test if we test for a difference of $5000? (10 points)

        c) Power of the test (5 points)

#Answer4

a. The probability of a type 1 error?

In [48]:
d1=data["Old Scheme (in thousands)"]
d1

0      57
1     103
2      59
3      75
4      84
5      73
6      35
7     110
8      44
9      82
10     67
11     64
12     78
13     53
14     41
15     39
16     80
17     87
18     73
19     65
20     28
21     62
22     49
23     84
24     63
25     77
26     67
27    101
28     91
29     50
Name: Old Scheme (in thousands), dtype: int64

In [51]:
d1=pd.DataFrame(d1)
d1.dtypes

Old Scheme (in thousands)    int64
dtype: object

In [54]:
d2= d1+5
d2

    Old Scheme (in thousands)
0                          62
1                         108
2                          64
3                          80
4                          89
5                          78
6                          40
7                         115
8                          49
9                          87
10                         72
11                         69
12                         83
13                         58
14                         46
15                         44
16                         85
17                         92
18                         78
19                         70
20                         33
21                         67
22                         54
23                         89
24                         68
25                         82
26                         72
27                        106
28                         96
29                         55

In [56]:
d1.describe()

       Old Scheme (in thousands)
count                  30.000000
mean                   68.033333
std                    20.455980
min                    28.000000
25%                    54.000000
50%                    67.000000
75%                    81.500000
max                   110.000000

In [57]:
 d2.describe()

       Old Scheme (in thousands)
count                  30.000000
mean                   73.033333
std                    20.455980
min                    33.000000
25%                    59.000000
50%                    72.000000
75%                    86.500000
max                   115.000000

In [59]:
# two-sample t-test
# null hypothesis: new scheme did not resulted in significant raised outputs
# this test assumes the two groups have the same variance...

t_statistic, p_value = ttest_ind(d1, d2)
print(t_statistic, p_value)

[-0.94666286] [0.34773807]

In [62]:
# Calculating Power of Test

(np.mean(d1) - np.mean(d2)) / np.sqrt(((30-1)*np.var(d1)+(30-1)*np.var(d2)) / 30+30-2)

Old Scheme (in thousands)   -0.175679
dtype: float64

In [63]:
print(ttest_power(0.17,alpha=0.05,nobs=60, alternative='larger'))

0.3657445876801987